app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into "users" ("name", "email", "password", "updated_at", "created_at") values ('Cristiano', 'criistiano.dev@gmail.com', '$2y$12$8W7vORrUy4841AqFvMpdfOuIwkydI/RRyIX8jeZxuawjKXcHoGiaq', '2025-06-17 16:34:34', '2025-06-17 16:34:34') returning "id"