app/Http/Controllers/Api/V1/EmployeeController.php

select * from "employees"
---
    public function index()
    {
        $employees = Employee::all();