app/Http/Controllers/Api/V1/EnterpriseController.php

select * from "enterprises" where "user_id" = 2
---
    public function index(): View
    {
        $enterprises = Enterprise::where('user_id', Auth::id())->get();

select * from "enterprises"
---
    public function create(): string
    {
        $enterprises = Enterprise::all();

insert into "enterprises" ("fantasy_name", "cnpj", "email", "phone", "status", "user_id", "address", "city", "number", "complement", "updated_at", "created_at") values ('Teste 22', '88961627000150', 'teste22@gmail.com', '716671671271', '1', '1', 'tsetse', 'Goiania', '22', 'teset', '2025-06-17 23:52:18', '2025-06-17 23:52:18') returning "id"
---
    public function store(StoreEnterpriseRequest $request): RedirectResponse
    {
        Enterprise::create($request->validated());

select * from "enterprises" where "enterprises"."id" = '3' limit 1
---
    public function edit(string $id): string
    {
        $enterprise = Enterprise::findOrFail($id);

update "enterprises" set "status" = '0', "updated_at" = '2025-06-17 20:11:47' where "id" = 1
---
    public function update(UpdateEnterpriseRequest $request, Enterprise $enterprise): RedirectResponse
    {
        $enterprise->update($request->validated());

select * from "enterprises" where "enterprises"."id" = '3' limit 1
delete from "enterprises" where "id" = 2
---
    public function destroy(string $id): RedirectResponse
    {
       $enterprise = Enterprise::findOrFail($id);
       $enterprise->delete();