app/Http/Controllers/Api/V1/EnterpriseController.php

select * from "enterprises" where "enterprises"."id" = '1' limit 1
---
    public function edit(string $id): string
    {
        $enterprise = Enterprise::findOrFail($id);